app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]
---
      <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
        <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
      <i class="far fa-heart"></i>
      <%= book.favorites.count %>