app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%mizuki%')
SELECT "books".* FROM "books"
---
  def index
    @users = User.all
    @user = current_user
    @book = Book.new
    @books = Book.all